TrampolineRTOS/trampoline/machines/cortex/armv6m/samd21/CMSIS-Atmel/Device/ATMEL/samd.h
/* ----------------------------------------------------------------------------
 *         SAM Software Package License
 * ----------------------------------------------------------------------------
 * Copyright (c) 2015, Atmel Corporation
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following condition is met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Atmel's name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ----------------------------------------------------------------------------
 */
#ifndef _SAMD_INCLUDED_
#define _SAMD_INCLUDED_

#if defined (__SAMD20E14__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20E15__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20E16__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20E17__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20E18__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20E1F__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20G14__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20G15__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20G16__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20G17__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20G18__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20G17U__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20G18U__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20J14__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20J15__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20J16__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20J17__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD20J18__)
#include "samd20/include/samd20.h"
#elif defined (__SAMD21E15A__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21E15B__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21E15L__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21E16A__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21E16B__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21E16L__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21E17A__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21E18A__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21G15A__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21G15B__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21G16A__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21G16B__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21G17A__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21G18A__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21J15A__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21J15B__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21J16A__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21J17A__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21J18A__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD21J16B__)
#include "samd21/include/samd21.h"
#elif defined (__SAMD09C13A__)
#include "samd09/include/samd09.h"
#elif defined (__SAMD10C13A__)
#include "samd10/include/samd10.h"
#elif defined (__SAMD10C14A__)
#include "samd10/include/samd10.h"
#elif defined (__SAMD10D13AS__)
#include "samd10/include/samd10.h"
#elif defined (__SAMD10D14AS__)
#include "samd10/include/samd10.h"
#elif defined (__SAMD10D13AM__)
#include "samd10/include/samd10.h"
#elif defined (__SAMD10D14AM__)
#include "samd10/include/samd10.h"
#elif defined (__SAMD11C14A__)
#include "samd11/include/samd11.h"
#elif defined (__SAMD11D14AS__)
#include "samd11/include/samd11.h"
#elif defined (__SAMD11D14AM__)
#include "samd11/include/samd11.h"
#elif defined (__SAMDA0E14A__)
#include "samda0/include/samda0.h"
#elif defined (__SAMDA0E15A__)
#include "samda0/include/samda0.h"
#elif defined (__SAMDA0E16A__)
#include "samda0/include/samda0.h"
#elif defined (__SAMDA0G14A__)
#include "samda0/include/samda0.h"
#elif defined (__SAMDA0G15A__)
#include "samda0/include/samda0.h"
#elif defined (__SAMDA0G16A__)
#include "samda0/include/samda0.h"
#elif defined (__SAMDA0J14A__)
#include "samda0/include/samda0.h"
#elif defined (__SAMDA0J15A__)
#include "samda0/include/samda0.h"
#elif defined (__SAMDA0J16A__)
#include "samda0/include/samda0.h"
#elif defined (__SAMDA1E14A__)
#include "samda1/include/samda1.h"
#elif defined (__SAMDA1E15A__)
#include "samda1/include/samda1.h"
#elif defined (__SAMDA1E16A__)
#include "samda1/include/samda1.h"
#elif defined (__SAMDA1G14A__)
#include "samda1/include/samda1.h"
#elif defined (__SAMDA1G15A__)
#include "samda1/include/samda1.h"
#elif defined (__SAMDA1G16A__)
#include "samda1/include/samda1.h"
#elif defined (__SAMDA1J14A__)
#include "samda1/include/samda1.h"
#elif defined (__SAMDA1J15A__)
#include "samda1/include/samda1.h"
#elif defined (__SAMDA1J16A__)
#include "samda1/include/samda1.h"
#endif

#endif /* _SAMD_INCLUDED_ */
